In [1]:
import geopandas as gpd 
import pandas as pd
from shapely import ops
import os
import shapely
import numpy as np
import psycopg2
import networkx as nx
import multiprocessing as mp
import pandana as pdna
from pandana import Network
from mpl_toolkits.basemap import Basemap
from shapely import wkt
from shapely.geometry import Polygon, LineString, Point, box
import matplotlib.pyplot as plt
from geoalchemy2 import Geometry, WKTElement
from sqlalchemy import *

from shapely.geometry import *
shapely.speedups.enable()
shapely.speedups.enable()

%matplotlib inline

In [2]:
# get cencus tract
con = psycopg2.connect(database="walkability", user="postgres", password=****,
    host="172.19.118.205",port="5432")
ct = gpd.read_postgis('SELECT * FROM walkability.public.census_tracts_blank',con)

In [3]:
ct.head(3)

,gid,__gid,ctuid,ctname,pruid,prname,cmauid,cmapuid,cmaname,cmatype,shape_leng,shape_area,ctnum,geotext,geom
0,1,62,5350001.00,0001.00,35,Ontario,535,35535,Toronto,B,36906.495474,6.619690e+06,535000100.0,535000100,(POLYGON ((320588.9306980086 4835855.647789237...
1,2,63,5350002.00,0002.00,35,Ontario,535,35535,Toronto,B,32534.307654,3.293422e+06,535000200.0,535000200,"(POLYGON ((316642.831678931 4832470.554474635,..."
2,3,87,5350264.00,0264.00,35,Ontario,535,35535,Toronto,B,12241.116870,3.464007e+06,535026400.0,535026400,(POLYGON ((314351.8668838083 4845056.100542194...

In [117]:
#import sys,os,os.path
#os.environ['HTTP_PROXY']="http://**:8080"
#os.environ['HTTPS_PROXY']="https://**:8080"
#import requests
#from contextlib import closing
#import csv

#with closing(requests.get(csvurl, stream=True)) as r:
 #   reader = csv.reader(r.iter_lines())
 #   list = list(reader)
 #   for row in list:
  #      # Handle each row here...
  #      print(row)

In [416]:

#df = pd.read_csv('/media/DATADRIVE/realestate/rental_prices/census_tracts/bedr_type_2010.csv')
#**#df = pd.read_csv('/media/DATADRIVE/walkability/ablajan/str_size_2010.csv')
df = pd.read_csv('/media/DATADRIVE/realestate/rental_prices/census_tracts/bedr_type_2018.csv', delimiter= ",", skiprows=2)

In [390]:
df.head()

,Unnamed: 0,Bachelor,Unnamed: 2,1 Bedroom,Unnamed: 4,2 Bedroom,Unnamed: 6,3 Bedroom +,Unnamed: 8,Total,Unnamed: 10,Unnamed: 11
0,0001.00,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,NaN
1,0002.00,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,NaN
2,0004.00,767,a,988,b,"1,100",b,**,NaN,949,a,NaN
3,0005.00,765,c,945,b,**,NaN,**,NaN,"1,041",d,NaN
4,0007.01,731,b,970,b,"1,357",c,**,NaN,"1,019",c,NaN

In [403]:
df.tail(10)

,Unnamed: 0,Bachelor,Unnamed: 2,1 Bedroom,Unnamed: 4,2 Bedroom,Unnamed: 6,3 Bedroom +,Unnamed: 8,Total,Unnamed: 10,Unnamed: 11
624,0831.02,**,NaN,"1,084",a,"1,365",a,**,NaN,"1,231",a,NaN
625,Toronto,957,a,"1,132",a,"1,326",a,"1,525",a,"1,240",a,NaN
626,Notes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
627,The following letter codes are used to indicat...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
628,** Data suppressed to protect confidentiality ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
629,++ Change in rent is not statistically signifi...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
630,- No units exist in the universe for this cat...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
631,n/a: Not applicable,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
632,"CMA, CA and CSD definitions are based on 2016 ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
633,Source,CMHC Rental Market Survey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [417]:
df.drop(df.tail(9).index,inplace=True)
df.drop(['Unnamed: 2', 'Unnamed: 4', 'Unnamed: 6', 'Unnamed: 8', 'Unnamed: 10', 'Unnamed: 11', ], axis=1, inplace=True)
df.head(3)

  Unnamed: 0 Bachelor 1 Bedroom 2 Bedroom 3 Bedroom + Total
0    0001.00       **        **        **          **    **
1    0002.00       **        **        **          **    **
2    0004.00      880     1,009     1,121          **   982

In [418]:
df = df.rename(columns={'Unnamed: 0': 'ctname', 'Bachelor': 'bachelor', '1 Bedroom': 'bedroom_1',  '2 Bedroom': 'bedroom_2', '3 Bedroom +': 'bedroom_3' , 'Total' : 'total'})
df['year'] = '2018'
df.head(3)

    ctname bachelor bedroom_1 bedroom_2 bedroom_3 total  year
0  0001.00       **        **        **        **    **  2018
1  0002.00       **        **        **        **    **  2018
2  0004.00      880     1,009     1,121        **   982  2018

In [419]:
# drop unwanted special charachters **
df.replace(['**'], '0', regex=False, inplace=True)
df.head(3)

    ctname bachelor bedroom_1 bedroom_2 bedroom_3 total  year
0  0001.00        0         0         0         0     0  2018
1  0002.00        0         0         0         0     0  2018
2  0004.00      880     1,009     1,121         0   982  2018

In [420]:
#specify column type in pandas dataframe
df['ctname'] = df['ctname'].astype('str')
df['bachelor'] = df['bachelor'].str.replace(',', '').astype(int)
df['bedroom_1'] = df['bedroom_1'].str.replace(',', '').astype(int)
df['bedroom_2'] = df['bedroom_2'].str.replace(',', '').astype(int)
df['bedroom_3'] = df['bedroom_3'].str.replace(',', '').astype(int)
df['total'] = df['total'].str.replace(',', '').astype(int)

df.dtypes

ctname       object
bachelor      int64
bedroom_1     int64
bedroom_2     int64
bedroom_3     int64
total         int64
year         object
dtype: object

In [421]:
df.head(3)

    ctname  bachelor  bedroom_1  bedroom_2  bedroom_3  total  year
0  0001.00         0          0          0          0      0  2018
1  0002.00         0          0          0          0      0  2018
2  0004.00       880       1009       1121          0    982  2018

In [422]:
# get sandbox connection
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:1234@172.19.118.205:5432/walkability')
df.to_sql('bedr_type_2018', engine)

In [108]:
shdf = ct.merge(df, left_on='ctname', right_on='ctname')
shdf.head(3)

,gid,__gid,ctuid,ctname,pruid,prname,cmauid,cmapuid,cmaname,cmatype,...,bedroom_1,reliability_b1,bedroom_2,reliablity_b2,bedroom_3,Unnamed: 8,Total,reliability_t,Unnamed: 11,Year
0,1,62,5350001.00,0001.00,35,Ontario,535,35535,Toronto,B,...,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017
1,2,63,5350002.00,0002.00,35,Ontario,535,35535,Toronto,B,...,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017
2,4,94,5350082.00,0082.00,35,Ontario,535,35535,Toronto,B,...,**,NaN,**,NaN,**,NaN,**,NaN,NaN,2017

In [112]:
#convert df to gdf
shdf['geometry'] = shdf['geom'].apply(lambda x: WKTElement(x.wkt, srid=2019))
shdf = gpd.GeoDataFrame(shdf)
shdf.crs = {'init': 'epsg:2019'}

In [114]:
#shdf

In [115]:
# Creating SQLAlchemy's engine to use
engine = create_engine('postgresql://postgres:1234@172.19.118.205:5432/walkability')

#shdf['geometry'] = shdf['geom'].apply(lambda x: WKTElement(x.wkt, srid=2019))

#drop the geometry column as it is now duplicative
shdf= shdf.drop('geom', 1, inplace=False)

# Use 'dtype' to specify column's type
# For the geom column, we will use GeoAlchemy's type 'Geometry'
shdf.to_sql("walkability_shdf", engine, if_exists='replace', index=False, 
                         dtype={'geometry': Geometry('MULTIPOLYGON', srid= 2019)})

In [423]:
dfs = pd.read_csv('/media/DATADRIVE/realestate/rental_prices/census_tracts/str_size_2018.csv', delimiter= ",", skiprows=2)

In [424]:
dfs.tail(10)

,Unnamed: 0,3-5 Units,Unnamed: 2,6-19 Units,Unnamed: 4,20-49 Units,Unnamed: 6,50-199 Units,Unnamed: 8,200+ Units,Unnamed: 10,Total,Unnamed: 12,Unnamed: 13
597,0831.02,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,**,NaN,NaN
598,Toronto,"1,358",b,"1,156",a,"1,183",a,"1,356",a,"1,468",a,"1,363",a,NaN
599,Notes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
600,The following letter codes are used to indicat...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
601,** Data suppressed to protect confidentiality ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
602,++ Change in rent is not statistically signifi...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
603,- No units exist in the universe for this cat...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
604,n/a: Not applicable,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
605,"CMA, CA and CSD definitions are based on 2016 ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
606,Source,CMHC Rental Market Survey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [336]:
#dfs.head(5)
#dfs.tail(10) drop tail unwanted strings
dfs.drop(dfs.tail(9).index, inplace=True)
dfs.drop(['Unnamed: 2', 'Unnamed: 4', 'Unnamed: 6', 'Unnamed: 8', 'Unnamed: 10', 'Unnamed: 12', 'Unnamed: 13' ], axis=1, inplace=True)
dfs.head(3)

  Unnamed: 0 3-5 Units 6-19 Units 20-49 Units 50-199 Units 200+ Units Total
0    0001.00        **         **          **           **         **    **
1    0002.00        **         **          **           **         **    **
2    0004.00        **         **         938        1,020         **   982

In [337]:
dfs = dfs.rename(columns={'Unnamed: 0': 'ctname', '3-5 Units': 'units3_5', '6-19 Units': 'units6_19',  '20-49 Units': 'units20_49', '50-199 Units': 'units50_199', '200+ Units': 'units_200' ,'Total' : 'total'})
dfs['year'] = '2018'
dfs.head(3)

    ctname units3_5 units6_19 units20_49 units50_199 units_200 total  year
0  0001.00       **        **         **          **        **    **  2018
1  0002.00       **        **         **          **        **    **  2018
2  0004.00       **        **        938       1,020        **   982  2018

In [338]:
# drop unwanted special charachters **
dfs.replace(['**'], '0', regex=False, inplace=True)
dfs.head(3)

    ctname units3_5 units6_19 units20_49 units50_199 units_200 total  year
0  0001.00        0         0          0           0         0     0  2018
1  0002.00        0         0          0           0         0     0  2018
2  0004.00        0         0        938       1,020         0   982  2018

In [339]:
#specify column type in pandas dataframe
dfs['ctname'] = dfs['ctname'].astype('str')
dfs['units3_5'] = dfs['units3_5'].str.replace(',', '').astype(int)
dfs['units6_19'] = dfs['units6_19'].str.replace(',', '').astype(int)
dfs['units20_49'] = dfs['units20_49'].str.replace(',', '').astype(int)
dfs['units50_199'] = dfs['units50_199'].str.replace(',', '').astype(int)
dfs['units_200'] = dfs['units_200'].str.replace(',', '').astype(int)
dfs['total'] = dfs['total'].str.replace(',', '').astype(int)
dfs.dtypes

ctname         object
units3_5        int64
units6_19       int64
units20_49      int64
units50_199     int64
units_200       int64
total           int64
year           object
dtype: object

In [340]:
# get database connection and save data
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:1234@172.19.118.205:5432/walkability')
df.to_sql('str_size_2018', engine)

In [49]:
dfc = pd.read_csv('/media/DATADRIVE/realestate/rental_prices/census_tracts/constr_year_2018.csv', delimiter= ",", skiprows=2)
dfc.drop(dfc.tail(9).index, inplace=True)
dfc.drop(['Unnamed: 2', 'Unnamed: 4', 'Unnamed: 6', 'Unnamed: 8', 'Unnamed: 10', 'Unnamed: 11'], axis=1, inplace=True)
dfc = dfc.rename(columns={'Unnamed: 0': 'ctname', 'Before 1960': 'before_1960', '1960 - 1979': 'y_1960_1979',  '1980 - 1999': 'y_1980_1999', '2000 or Later': 'y_2000_later', 'Total' : 'total'})
dfc['year'] = '2018'

dfc.head(3)

    ctname before_1960 y_1960_1979 y_1980_1999 y_2000_later total  year
0  0001.00          **          **          **           **    **  2018
1  0002.00          **          **          **           **    **  2018
2  0004.00         968       1,015          **           **   982  2018

In [50]:
# drop unwanted special charachters **
dfc.replace(['**'], '0', regex=False, inplace=True)
#specify column type in pandas dataframe

In [51]:
dfc.head(3)

    ctname before_1960 y_1960_1979 y_1980_1999 y_2000_later total  year
0  0001.00           0           0           0            0     0  2018
1  0002.00           0           0           0            0     0  2018
2  0004.00         968       1,015           0            0   982  2018

In [52]:
#specify column type in pandas dataframe
dfc['ctname'] = dfc['ctname'].astype('str')
dfc['before_1960'] = dfc['before_1960'].str.replace(',', '').astype('int')
dfc['y_1960_1979'] = dfc['y_1960_1979'].str.replace(',', '').astype('int')
dfc['y_1980_1999'] = dfc['y_1980_1999'].str.replace(',', '').astype('int')
dfc['y_2000_later'] = dfc['y_2000_later'].str.replace(',', '').astype('int')
dfc['total'] = dfc['total'].str.replace(',', '').astype('int')
dfc.dtypes

ctname          object
before_1960      int64
y_1960_1979      int64
y_1980_1999      int64
y_2000_later     int64
total            int64
year            object
dtype: object

In [53]:
# get database connection and save data
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:1234@172.19.118.205:5432/walkability')
dfc.to_sql('constr_year_2018', engine)